cl-org-mode.org
CL-ORG-MODE : A Parser of org-mode outlines

 /abstract/: CL-ORG-MODE is a parser for org-mode files that uses an
 extensible CLOS-based recursive descent parser to create a tree of
 org-mode nodes. Also included is a (primitive) system for literate
 programming using org-mode
* Introduction
  
  Org-mode is an emacs mode that provides, among other things, an
  outliner and document authoring system. CL-ORG-MODE is a library for
  manipulating org-mode files in Common Lisp.

** Features 

  CL-ORG-MODE is still in development, but is already being used to
  develop itself. Some features:

      + An extensible parser with a concrete implementation for a
        subset of org-mode features.

      + A simple literate programming like system for writing Common
        Lisp code inside org mode.

** Planned Features
   
   + Better integration with slime (the package issue).
   + Extensible printer to go with the parser. 
   + 'round trip' from source files to org-mode nodes, so changes in
     generated .lisp files end up in the .org.

* Finding and Installing

  This document, or possibly the document used to generate this
  document, is a complete copy of the cl-org-mode source... it
  just needs extracting, which requires cl-org-mode or some manual
  labour. If the former idea is more to your liking, get it using
  git :

* CL-ORG-MODE Documentation

** The Parser
*** Parser Concepts
    
    Right now the parser is very simple. The function READ-ORG-FILE
    will read an org-mode file into a tree of ORG-NODEs.

*** Parser Dictionary
**** /Function/ =READ-ORG-FILE=
     
     /Function/ =READ-ORG-FILE=
     
     *Syntax:*
     
     =read-org-file= pathname => /result/
     
     *Description:*
     
     Read the org file located at PATHNAME and return an ORG-FILE node.
** Org Nodes
*** Org Node Concepts
*** Org Node Dictionary
** The Literate Programming System 
*** Literate Programming Concepts

    The literate programming system is very simple at the
    moment. Essentially, we recurse through the org-mode nodes. If a 
    node sets the :source-file: property (=C-c C-x p source-file RET
    filename.lisp RET=), any SOURCE-NODE has its contents inserted in
    that file, in the order they appear.

    The :source-directory: sets the directory in which the files will
    be generated. Relative pathnames will be resolved relative to the
    location of the org-mode file itself.

*** Literate Programming Dictionary 
**** /Function/ =TANGLE-ORG-NODE=
     
     /Function/ =TANGLE-ORG-NODE=
     
     *Syntax:*
     
     =tangle-org-node= node /&key/ source-directory source-file => /result/
     
     *Arguments and Values:*
     
     node---an ORG-NODE
     source-directory---a pathname,
     source-file---a pathname.
     result---returns NIL. 
     
     *Description:*
     
     Walk node and all its children, and print the contents of
     any SRC-NODE to source-file. If source-file is a relative pathname, it
     will be merged with source-directory.
     
     If node or any of its children contain :source-file:
     or :source-directory: properties, they will replace the value of
     source-file or source-directory for that node and its children.
NIL

    


* CL-ORG-MODE : The Source Code
  :PROPERTIES:
  :source-directory: src/
  :END:
** The CL-ORG-MODE system definition
   :PROPERTIES:
   :source-file: ../cl-org-mode.asd
   :END:
#+BEGIN_SRC lisp
;;; -*- lisp -*-

(defsystem :cl-org-mode
  :components 
  ((:module :src
	    :serial t
	    :components
	    ((:file "packages")
	     (:file "utils")
	     (:file "protocol")
	     (:file "parser")
	     (:file "cl-org-mode")
	     )))
  :serial t
  :depends-on (:alexandria :closer-mop))

#+END_SRC
** CL-ORG-MODE Package
   :PROPERTIES:
   :source-file: packages.lisp
   :END:
   
   
   
#+BEGIN_SRC lisp   
(defpackage :cl-org-mode 
  (:use :common-lisp))
#+END_SRC 
   
