cl-org-mode.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>CL-ORG-MODE : A Parser of org-mode outlines</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2009-12-01 12:10:19 PST"/>
<meta name="author" content="Drew Crampsie"/>
</head><body>
<h1 class="title">CL-ORG-MODE : A Parser of org-mode outlines</h1>

<p><i>abstract</i>: CL-ORG-MODE is a parser for org-mode files that uses an
extensible CLOS-based recursive descent parser to create a tree of
org-mode nodes. Also included is a (primitive) system for literate
programming using org-mode
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction </a>
<ul>
<li><a href="#sec-1.1">1.1 Features </a></li>
<li><a href="#sec-1.2">1.2 Planned Features </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Finding and Installing </a></li>
<li><a href="#sec-3">3 CL-ORG-MODE Documentation </a>
<ul>
<li><a href="#sec-3.1">3.1 The Parser </a>
<ul>
<li><a href="#sec-3.1.1">3.1.1 Parser Concepts </a></li>
<li><a href="#sec-3.1.2">3.1.2 Parser Dictionary </a></li>
</ul>
</li>
<li><a href="#sec-3.2">3.2 Org Nodes </a>
<ul>
<li><a href="#sec-3.2.1">3.2.1 Org Node Concepts </a></li>
<li><a href="#sec-3.2.2">3.2.2 Org Node Dictionary </a></li>
</ul>
</li>
<li><a href="#sec-3.3">3.3 The Literate Programming System </a>
<ul>
<li><a href="#sec-3.3.1">3.3.1 Literate Programming Concepts </a></li>
<li><a href="#sec-3.3.2">3.3.2 Literate Programming Dictionary </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 CL-ORG-MODE : The Source Code </a>
<ul>
<li><a href="#sec-4.1">4.1 The CL-ORG-MODE system definition </a></li>
<li><a href="#sec-4.2">4.2 CL-ORG-MODE Package </a></li>
<li><a href="#sec-4.3">4.3 The Parser Protocol </a></li>
<li><a href="#sec-4.4">4.4 The Parser </a></li>
<li><a href="#sec-4.5">4.5 An implementation of the protocol for org-mode files </a>
<ul>
<li><a href="#sec-4.5.1">4.5.1 The ORG-NODE base class + default text node </a></li>
<li><a href="#sec-4.5.2">4.5.2 ORG-PARENT-NODE : for nodes that have children, + ROOT-NODE. </a></li>
<li><a href="#sec-4.5.3">4.5.3 DELIMITED-NODE </a></li>
<li><a href="#sec-4.5.4">4.5.4 OUTLINE-NODE : Used for org-mode outlines </a></li>
<li><a href="#sec-4.5.5">4.5.5 SRC-NODE : Make blocks out of BEGIN<sub>SRC</sub> nodes. </a></li>
<li><a href="#sec-4.5.6">4.5.6 PROPERTIES-NODE: Capture the :PROPERTIES drawer </a></li>
</ul>
</li>
<li><a href="#sec-4.6">4.6 A printer for org-nodes </a></li>
<li><a href="#sec-4.7">4.7 Utilities </a></li>
</ul>
</li>
<li><a href="#sec-5">5 ORG-LITERATE-PROGRAMMING Source Code </a></li>
<li><a href="#sec-6">6 ORG-LISP-DOCUMENTATION </a>
<ul>
<li><a href="#sec-6.1">6.1 Doctstring parsing </a></li>
<li><a href="#sec-6.2">6.2 Print lisp documentation </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Introduction </h2>
<div id="text-1">


<p>
Org-mode is an emacs mode that provides, among other things, an
outliner and document authoring system. CL-ORG-MODE is a library for
manipulating org-mode files in Common Lisp.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">1.1 Features </h3>
<div id="text-1.1">


<p>
CL-ORG-MODE is still in development, but is already being used to
develop itself. Some features:
</p>
<ul>
<li>
An extensible parser with a concrete implementation for a
subset of org-mode features.

</li>
<li>
A simple literate programming like system for writing Common
Lisp code inside org mode.

</li>
</ul>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2">1.2 Planned Features </h3>
<div id="text-1.2">


<ul>
<li>
Better integration with slime (the package issue).
</li>
<li>
Extensible printer to go with the parser. 
</li>
<li>
'round trip' from source files to org-mode nodes, so changes in
generated .lisp files end up in the .org.

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 Finding and Installing </h2>
<div id="text-2">


<p>
This document, or possibly the document used to generate this
document, is a complete copy of the cl-org-mode source&hellip; it
just needs extracting, which requires cl-org-mode or some manual
labour. If the former idea is more to your liking, get it using
git :
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3 CL-ORG-MODE Documentation </h2>
<div id="text-3">



</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1">3.1 The Parser </h3>
<div id="text-3.1">


</div>

<div id="outline-container-3.1.1" class="outline-4">
<h4 id="sec-3.1.1">3.1.1 Parser Concepts </h4>
<div id="text-3.1.1">


<p>
Right now the parser is very simple. The function READ-ORG-FILE
will read an org-mode file into a tree of ORG-NODEs.
</p>
</div>

</div>

<div id="outline-container-3.1.2" class="outline-4">
<h4 id="sec-3.1.2">3.1.2 Parser Dictionary </h4>
<div id="text-3.1.2">

<ul>
<li id="sec-3.1.2.1"><i>Function</i> <code>READ-ORG-FILE</code> <br/>

<p>
<i>Function</i> <code>READ-ORG-FILE</code>
</p>
<p>
<b>Syntax:</b>
</p>
<p>
<code>read-org-file</code> pathname =&gt; <i>result</i>
</p>
<p>
<b>Description:</b>
</p>
<p>
Read the org file located at PATHNAME and return an ORG-FILE node.
</p></li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2">3.2 Org Nodes </h3>
<div id="text-3.2">


</div>

<div id="outline-container-3.2.1" class="outline-4">
<h4 id="sec-3.2.1">3.2.1 Org Node Concepts </h4>
<div id="text-3.2.1">

</div>

</div>

<div id="outline-container-3.2.2" class="outline-4">
<h4 id="sec-3.2.2">3.2.2 Org Node Dictionary </h4>
<div id="text-3.2.2">

</div>
</div>

</div>

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3">3.3 The Literate Programming System </h3>
<div id="text-3.3">


</div>

<div id="outline-container-3.3.1" class="outline-4">
<h4 id="sec-3.3.1">3.3.1 Literate Programming Concepts </h4>
<div id="text-3.3.1">


<p>
The literate programming system is very simple at the
moment. Essentially, we recurse through the org-mode nodes. If a 
node sets the :source-file: property (<code>C-c C-x p source-file RET     filename.lisp RET</code>), any SOURCE-NODE has its contents inserted in
that file, in the order they appear.
</p>
<p>
The :source-directory: sets the directory in which the files will
be generated. Relative pathnames will be resolved relative to the
location of the org-mode file itself.
</p>
</div>

</div>

<div id="outline-container-3.3.2" class="outline-4">
<h4 id="sec-3.3.2">3.3.2 Literate Programming Dictionary </h4>
<div id="text-3.3.2">

<ul>
<li id="sec-3.3.2.1"><i>Function</i> <code>TANGLE-ORG-NODE</code> <br/>

<p>
<i>Function</i> <code>TANGLE-ORG-NODE</code>
</p>
<p>
<b>Syntax:</b>
</p>
<p>
<code>tangle-org-node</code> node <i>&amp;key</i> source-directory source-file =&gt; <i>result</i>
</p>
<p>
<b>Arguments and Values:</b>
</p>
<p>
node&mdash;an ORG-NODE
source-directory&mdash;a pathname,
source-file&mdash;a pathname.
result&mdash;returns NIL. 
</p>
<p>
<b>Description:</b>
</p>
<p>
Walk node and all its children, and print the contents of
any SRC-NODE to source-file. If source-file is a relative pathname, it
will be merged with source-directory.
</p>
<p>
If node or any of its children contain :source-file:
or :source-directory: properties, they will replace the value of
source-file or source-directory for that node and its children.
NIL
</p>



</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">4 CL-ORG-MODE : The Source Code </h2>
<div id="text-4">


</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1">4.1 The CL-ORG-MODE system definition </h3>
<div id="text-4.1">




<pre class="src src-lisp">
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">-*- lisp -*-
</span>
(defsystem <span style="color: #da70d6;">:cl-org-mode</span>
  <span style="color: #da70d6;">:components</span> 
  ((<span style="color: #da70d6;">:module</span> <span style="color: #da70d6;">:src</span>
            <span style="color: #da70d6;">:serial</span> t
            <span style="color: #da70d6;">:components</span>
            ((<span style="color: #da70d6;">:file</span> <span style="color: #bc8f8f;">"packages"</span>)
             (<span style="color: #da70d6;">:file</span> <span style="color: #bc8f8f;">"utils"</span>)
             (<span style="color: #da70d6;">:file</span> <span style="color: #bc8f8f;">"protocol"</span>)
             (<span style="color: #da70d6;">:file</span> <span style="color: #bc8f8f;">"parser"</span>)
             (<span style="color: #da70d6;">:file</span> <span style="color: #bc8f8f;">"cl-org-mode"</span>)
             )))
  <span style="color: #da70d6;">:serial</span> t
  <span style="color: #da70d6;">:depends-on</span> (<span style="color: #da70d6;">:alexandria</span> <span style="color: #da70d6;">:closer-mop</span>))

</pre>



</div>

</div>

<div id="outline-container-4.2" class="outline-3">
<h3 id="sec-4.2">4.2 CL-ORG-MODE Package </h3>
<div id="text-4.2">







<pre class="src src-lisp">
(<span style="color: #a020f0;">defpackage</span> <span style="color: #228b22;">:cl-org-mode</span> 
  (<span style="color: #da70d6;">:use</span> <span style="color: #da70d6;">:common-lisp</span>))
</pre>




</div>

</div>
