cl-org-mode.org
** The Parser Protocol
   :PROPERTIES:
   :source-file: protocol.lisp
   :END: 

#+BEGIN_SRC lisp
(in-package :cl-org-mode)

(defclass node ()
  ((next-node :initarg :next-node 
	      :accessor node.next-node 
	      :initform nil))
  (:documentation "Base class for all nodes"))

(defvar *dispatchers* nil
  "A dynamic variable to hold a list of nodes to use as  dispatchers.
The default method for FIND-NEXT-NODE will call NODE-START on these nodes")

(defgeneric node-dispatchers (node)
  (:documentation "Called by the reader in order to set the dynamic dispatch environment before reading the next node"))

(defgeneric find-next-node (node next-node stack)
  (:documentation "Find the next node that starts in STREAM, implicitly ending NODE.

All methods must return the multiple values (VALUES NEW-NODE OLD-STACK) as if from NODE-START. "))

(defgeneric read-next-node (node next-node stream)
  (:documentation "read the next node in stream and return it.

This is the main entry point for specializing node types."))

(defgeneric read-node (starting-node stream)
  (:documentation "return the next node after reading it from the stream 

The default method simply calls READ-NEXT-NODE.")
  (:method (starting-node stream)
    (read-next-node starting-node (node.next-node starting-node) stream)))

(defgeneric node-start (node stack)
  (:documentation 
  "Indicate a new node should begin at this point in the stack. 

The parser will pass a class prototype instance via NODE, so it
shouldn't be mutated.

All methods _must_ return (VALUES NEW-NODE OLD-STACK) where NEW-NODE
created NODE object and any remaining stack which likely belongs to
the previous node."))

(defgeneric node-end (node next-node stack)
  (:documentation 
  "return true if stack of characters indicate this node has finished reading"))


(defgeneric finalize-node (node next-node stack)
  (:documentation "Called when the node has finished reading.
 
This is usually either because node-end returned true or implicitly
because another node has started"))
#+END_SRC

** The Parser
   :PROPERTIES:
   :source-file: parser.lisp
   :END:

#+BEGIN_SRC lisp   
(in-package :cl-org-mode)

(defmethod read-next-node (node (next-node null) stream) 
  "This method is called when we don't yet know what the next node is"
  (let (stack)
    (loop for char = (read-char stream nil)
       :if (null char) 
       :do (return (finalize-node node NIL stack))
       :else 
       :do (push char stack)
	 (multiple-value-bind (new-node old-stack)
		 (find-next-node node next-node stack)	   
	       (when new-node 
		 (return (finalize-node node new-node old-stack)))))))

(defmethod read-next-node (node (next-node node) stream)
  "When we know what the node is already, just return it"
  next-node)

(defmethod read-next-node :around (node next-node stream)
  (let ((*dispatchers* (node-dispatchers node)))
  ;(warn "DISPATHERS FOR ~A ~A: ~A" node next-node *dispatchers*)
    (call-next-method)))


(defmethod find-next-node (node next-node stack)
  (loop for object in *dispatchers*
       :do (multiple-value-bind (result old-stack)
	       (node-start object stack)
	     (when result (return (values result old-stack))))))
#+END_SRC
	     
** An implementation of the protocol for org-mode files
   :PROPERTIES:
   :source-file: cl-org-mode.lisp
   :END:
   
*** The ORG-NODE base class + default text node
#+BEGIN_SRC lisp
(in-package :cl-org-mode)

(defclass org-node (node) ())

(defmethod node-start ((node org-node) stream) nil)

(defmethod node-end ((node org-node) next-node stream) nil)

(defmethod node-end ((node org-node) (next-node null) stack)
  T)

(defmethod node-dispatchers ((node org-node))
  (or *dispatchers* 
      (mapcar #'make-instance '(src-node properties-node outline-node))))

(defmethod node-prototypes (node)
  (error "never call"))


(defmethod finalize-node (node next-node stack)
  "If there is something on the stack, and a new node has started,
then stick it in the default node"
;  (break "Finalizing ~A ~A ~A ~A" node next-node stack (node.next-node node))
  (setf (node.next-node node) 
	(if stack
	    (make-default-node node next-node stack)
	  next-node)))

(defgeneric make-default-node (node next-node stack)
  (:documentation "Anything not in another node ends up here")
  (:method ((node org-node) next-node stack)
;  (break "Making default: ~A ~A ~A" node next-node stack)
	   (make-instance 'text-node 
			  :text (stack->string stack)
			  :next-node next-node)))

(defclass text-node (org-node)
  ((text :initarg :text :accessor node.text)))
#+END_SRC  

