cl-org-mode.html

<div id="outline-container-4.3" class="outline-3">
<h3 id="sec-4.3">4.3 The Parser Protocol </h3>
<div id="text-4.3">





<pre class="src src-lisp">
(<span style="color: #a020f0;">in-package</span> <span style="color: #da70d6;">:cl-org-mode</span>)

(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">node</span> ()
  ((next-node <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:next-node</span> 
              <span style="color: #da70d6;">:accessor</span> node.next-node 
              <span style="color: #da70d6;">:initform</span> nil))
  (<span style="color: #da70d6;">:documentation</span> <span style="color: #bc8f8f;">"Base class for all nodes"</span>))

(<span style="color: #a020f0;">defvar</span> <span style="color: #b8860b;">*dispatchers*</span> nil
  <span style="color: #bc8f8f;">"A dynamic variable to hold a list of nodes to use as  dispatchers.
The default method for FIND-NEXT-NODE will call NODE-START on these nodes"</span>)

(<span style="color: #a020f0;">defgeneric</span> <span style="color: #0000ff;">node-dispatchers</span> (node)
  (<span style="color: #da70d6;">:documentation</span> <span style="color: #bc8f8f;">"Called by the reader in order to set the dynamic dispatch environment before reading the next node"</span>))

(<span style="color: #a020f0;">defgeneric</span> <span style="color: #0000ff;">find-next-node</span> (node next-node stack)
  (<span style="color: #da70d6;">:documentation</span> <span style="color: #bc8f8f;">"Find the next node that starts in STREAM, implicitly ending NODE.

All methods must return the multiple values (VALUES NEW-NODE OLD-STACK) as if from NODE-START. "</span>))

(<span style="color: #a020f0;">defgeneric</span> <span style="color: #0000ff;">read-next-node</span> (node next-node stream)
  (<span style="color: #da70d6;">:documentation</span> <span style="color: #bc8f8f;">"read the next node in stream and return it.

This is the main entry point for specializing node types."</span>))

(<span style="color: #a020f0;">defgeneric</span> <span style="color: #0000ff;">read-node</span> (starting-node stream)
  (<span style="color: #da70d6;">:documentation</span> <span style="color: #bc8f8f;">"return the next node after reading it from the stream 

The default method simply calls READ-NEXT-NODE."</span>)
  (<span style="color: #da70d6;">:method</span> (starting-node stream)
    (read-next-node starting-node (node.next-node starting-node) stream)))

(<span style="color: #a020f0;">defgeneric</span> <span style="color: #0000ff;">node-start</span> (node stack)
  (<span style="color: #da70d6;">:documentation</span> 
  <span style="color: #bc8f8f;">"Indicate a new node should begin at this point in the stack. 

The parser will pass a class prototype instance via NODE, so it
shouldn't be mutated.

All methods _must_ return (VALUES NEW-NODE OLD-STACK) where NEW-NODE
created NODE object and any remaining stack which likely belongs to
the previous node."</span>))

(<span style="color: #a020f0;">defgeneric</span> <span style="color: #0000ff;">node-end</span> (node next-node stack)
  (<span style="color: #da70d6;">:documentation</span> 
  <span style="color: #bc8f8f;">"return true if stack of characters indicate this node has finished reading"</span>))


(<span style="color: #a020f0;">defgeneric</span> <span style="color: #0000ff;">finalize-node</span> (node next-node stack)
  (<span style="color: #da70d6;">:documentation</span> <span style="color: #bc8f8f;">"Called when the node has finished reading.
 
This is usually either because node-end returned true or implicitly
because another node has started"</span>))
</pre>




</div>

</div>

<div id="outline-container-4.4" class="outline-3">
<h3 id="sec-4.4">4.4 The Parser </h3>
<div id="text-4.4">





<pre class="src src-lisp">
(<span style="color: #a020f0;">in-package</span> <span style="color: #da70d6;">:cl-org-mode</span>)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">read-next-node</span> (node (next-node null) stream) 
  <span style="color: #bc8f8f;">"This method is called when we don't yet know what the next node is"</span>
  (<span style="color: #a020f0;">let</span> (stack)
    (<span style="color: #a020f0;">loop</span> for char = (read-char stream nil)
       <span style="color: #da70d6;">:if</span> (null char) 
       <span style="color: #da70d6;">:do</span> (<span style="color: #a020f0;">return</span> (finalize-node node NIL stack))
       <span style="color: #da70d6;">:else</span> 
       <span style="color: #da70d6;">:do</span> (push char stack)
         (<span style="color: #a020f0;">multiple-value-bind</span> (new-node old-stack)
                 (find-next-node node next-node stack)     
               (<span style="color: #a020f0;">when</span> new-node 
                 (<span style="color: #a020f0;">return</span> (finalize-node node new-node old-stack)))))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">read-next-node</span> (node (next-node node) stream)
  <span style="color: #bc8f8f;">"When we know what the node is already, just return it"</span>
  next-node)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">read-next-node</span> <span style="color: #da70d6;">:around</span> (node next-node stream)
  (<span style="color: #a020f0;">let</span> ((*dispatchers* (node-dispatchers node)))
  <span style="color: #b22222;">;</span><span style="color: #b22222;">(warn "DISPATHERS FOR ~A ~A: ~A" node next-node *dispatchers*)
</span>    (call-next-method)))


(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">find-next-node</span> (node next-node stack)
  (<span style="color: #a020f0;">loop</span> for object in *dispatchers*
       <span style="color: #da70d6;">:do</span> (<span style="color: #a020f0;">multiple-value-bind</span> (result old-stack)
               (node-start object stack)
             (<span style="color: #a020f0;">when</span> result (<span style="color: #a020f0;">return</span> (values result old-stack))))))
</pre>




</div>

</div>

<div id="outline-container-4.5" class="outline-3">
<h3 id="sec-4.5">4.5 An implementation of the protocol for org-mode files </h3>
<div id="text-4.5">



</div>

<div id="outline-container-4.5.1" class="outline-4">
<h4 id="sec-4.5.1">4.5.1 The ORG-NODE base class + default text node </h4>
<div id="text-4.5.1">




<pre class="src src-lisp">
(<span style="color: #a020f0;">in-package</span> <span style="color: #da70d6;">:cl-org-mode</span>)

(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">org-node</span> (node) ())

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-start</span> ((node org-node) stream) nil)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-end</span> ((node org-node) next-node stream) nil)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-end</span> ((node org-node) (next-node null) stack)
  T)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-dispatchers</span> ((node org-node))
  (or *dispatchers* 
      (mapcar #'make-instance '(src-node properties-node outline-node))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-prototypes</span> (node)
  (<span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #bc8f8f;">"never call"</span>))


(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">finalize-node</span> (node next-node stack)
  <span style="color: #bc8f8f;">"If there is something on the stack, and a new node has started,
then stick it in the default node"</span>
<span style="color: #b22222;">;  </span><span style="color: #b22222;">(break "Finalizing ~A ~A ~A ~A" node next-node stack (node.next-node node))
</span>  (setf (node.next-node node) 
        (<span style="color: #a020f0;">if</span> stack
            (make-default-node node next-node stack)
          next-node)))

(<span style="color: #a020f0;">defgeneric</span> <span style="color: #0000ff;">make-default-node</span> (node next-node stack)
  (<span style="color: #da70d6;">:documentation</span> <span style="color: #bc8f8f;">"Anything not in another node ends up here"</span>)
  (<span style="color: #da70d6;">:method</span> ((node org-node) next-node stack)
<span style="color: #b22222;">;  </span><span style="color: #b22222;">(break "Making default: ~A ~A ~A" node next-node stack)
</span>           (make-instance 'text-node 
                          <span style="color: #da70d6;">:text</span> (stack-&gt;string stack)
                          <span style="color: #da70d6;">:next-node</span> next-node)))

(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">text-node</span> (org-node)
  ((text <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:text</span> <span style="color: #da70d6;">:accessor</span> node.text)))
</pre>




</div>

</div>
