cl-org-mode.org
*** ORG-PARENT-NODE : for nodes that have children, + ROOT-NODE.
#+BEGIN_SRC lisp
(in-package :cl-org-mode)

(defclass org-parent-node (org-node)
  ((child-nodes :initarg :children 
		:accessor node.children
 		:initform nil)
   (include-end-node :initarg :include-end-node
		     :initform nil
		     :reader include-end-node-p))
  (:documentation "Some node contain other nodes"))

(defun read-child-nodes (root-node stack stream )
  (loop 
     :for next-node = (read-node root-node stream) 
     :then (and next-node (read-node next-node stream))
     :until (node-end root-node next-node stack)
     ;:do (warn "reading root ~A : next-node : ~A ~A" root-node next-node stack)
     :collect next-node into nodes
     :finally (return (if (include-end-node-p root-node)
			  (values (nconc nodes (list next-node)) 
				  next-node) 
			  (values  nodes next-node)))))
  

(defmethod read-next-node ((node org-parent-node)  (next-node null) stream)
  (call-next-method)

  (multiple-value-bind (children new-node) 
      (read-child-nodes node nil stream)
    (when children 
      (unless (eql (car children) (node.next-node node))
	;;; Somebody short-circuited the process, namely property-node. why?
	(setf children (cons (node.next-node node) children))
	))

    (setf (node.children node) children)
    new-node))

(defmethod read-node :around ((node org-parent-node) stream)
 (let ((new-node (call-next-method)))
   (if (include-end-node-p node)
       (read-node new-node stream)
     new-node)))

(defun read-parent-node (parent-node stream)
  (read-node parent-node stream) parent-node) 
    
(defclass org-file (org-parent-node) 
  ((pathname :accessor node.pathname :initarg :pathname)))

(defun read-org-file (pathname)
  (let ((node (make-instance 'org-file :pathname pathname)))
    (alexandria:with-input-from-file (stream pathname) 
      (read-parent-node node stream))))
#+END_SRC
*** DELIMITED-NODE
    
#+BEGIN_SRC lisp
(in-package :cl-org-mode)

(defclass delimited-node (org-parent-node)
  ((opening-delimiter :initarg :opening-delimiter :accessor node.opening-delimiter :initform nil)
   (closing-delimiter :initarg :closing-delimiter :accessor node.closing-delimiter :initform nil)
   (closing-delimiter-node :accessor node.closing-delimiter-node)
   (node-closed :initform nil :accessor node.closed-p))

  (:default-initargs :include-end-node t))

(defclass closing-delimiter-node (org-node)
 ((opening-delimiter-node :accessor node.opening-delimiter-node :initarg :opening-delimiter-node)))

(defmethod shared-initialize :after ((node delimited-node) slots &rest args)
  (declare (ignore args))
  (setf (node.closing-delimiter-node node)
	(make-instance 'closing-delimiter-node :opening-delimiter-node node)))

(defmethod node-dispatchers ((node delimited-node))
  (if (node.closed-p node)
      (call-next-method)
      (cons (node.closing-delimiter-node node) (call-next-method))))

(defmethod node-start ((node delimited-node) stack)
  (with-slots (opening-delimiter) node
    (when opening-delimiter 
      (multiple-value-bind (delimiter old-stack)
	  (stack-starts-with stack opening-delimiter)
	
	(when delimiter
	  (values (make-instance (class-of node) 
				 :opening-delimiter (stack->string delimiter)) 
		   old-stack))))))

(defmethod node-start ((node closing-delimiter-node) stack)

  (with-slots (closing-delimiter) (node.opening-delimiter-node node)
    (multiple-value-bind (indicator old-stack)
	(stack-starts-with stack closing-delimiter)
      (when indicator 
	(values node 
		old-stack)))))

(defmethod node-end ((node delimited-node) (next-node closing-delimiter-node) stack)
  (when (eq next-node (node.closing-delimiter-node node))
    (setf (node.closed-p node) t)))

(defmethod read-next-node :around ((node delimited-node) next-node stream)
  (call-next-method)
)
#+END_SRC

*** OUTLINE-NODE : Used for org-mode outlines
    

#+BEGIN_SRC lisp
(in-package :cl-org-mode)

(defclass outline-node (org-parent-node) 
  ((heading :accessor node.heading :initform nil :initarg :heading)
   (heading-level-indicator :accessor node.heading-level-indicator
			    :initform nil
			    :initarg :indicator)))

(defun at-outline-node-p (stack)
  (let ((char (first stack))
	(stack (rest stack)))
    (and (eql char #\space)
	 (eql (first stack) #\*)
	 (if (or (null (rest stack))
		 (eql #\Newline (second stack)))
	     (values t  (rest stack))
	     (at-outline-node-p (cons char (rest stack)))))))

(defmethod node-start ((node outline-node) stack)
  (multiple-value-bind (pred old-stack) 
      (at-outline-node-p stack)
    (if pred 
	(values  
	   (make-instance (class-of node) 
			  :indicator
			  (loop 
			     for cons on stack 
			     until (eq cons old-stack) 
			     collect (car cons))) 
	   old-stack))))

(defmethod node-end ((node outline-node) (next-node outline-node) stack)   
  (<= (length (node.heading-level-indicator next-node))
      (length (node.heading-level-indicator node))))

(defmethod node-end ((node outline-node) (next-node null) stack)   
  t)

(defmethod read-next-node ((node outline-node) (next-node null) stream)
  (setf (node.heading node) (read-line stream nil))
  (call-next-method))
#+END_SRC 

