cl-org-mode.html

<div id="outline-container-4.5.2" class="outline-4">
<h4 id="sec-4.5.2">4.5.2 ORG-PARENT-NODE : for nodes that have children, + ROOT-NODE. </h4>
<div id="text-4.5.2">




<pre class="src src-lisp">
(<span style="color: #a020f0;">in-package</span> <span style="color: #da70d6;">:cl-org-mode</span>)

(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">org-parent-node</span> (org-node)
  ((child-nodes <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:children</span> 
                <span style="color: #da70d6;">:accessor</span> node.children
                <span style="color: #da70d6;">:initform</span> nil)
   (include-end-node <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:include-end-node</span>
                     <span style="color: #da70d6;">:initform</span> nil
                     <span style="color: #da70d6;">:reader</span> include-end-node-p))
  (<span style="color: #da70d6;">:documentation</span> <span style="color: #bc8f8f;">"Some node contain other nodes"</span>))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">read-child-nodes</span> (root-node stack stream )
  (<span style="color: #a020f0;">loop</span> 
     <span style="color: #da70d6;">:for</span> next-node = (read-node root-node stream) 
     <span style="color: #da70d6;">:then</span> (and next-node (read-node next-node stream))
     <span style="color: #da70d6;">:until</span> (node-end root-node next-node stack)
     <span style="color: #b22222;">;</span><span style="color: #b22222;">:do (warn "reading root ~A : next-node : ~A ~A" root-node next-node stack)
</span>     <span style="color: #da70d6;">:collect</span> next-node into nodes
     <span style="color: #da70d6;">:finally</span> (<span style="color: #a020f0;">return</span> (<span style="color: #a020f0;">if</span> (include-end-node-p root-node)
                          (values (nconc nodes (list next-node)) 
                                  next-node) 
                          (values  nodes next-node)))))
  

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">read-next-node</span> ((node org-parent-node)  (next-node null) stream)
  (call-next-method)

  (<span style="color: #a020f0;">multiple-value-bind</span> (children new-node) 
      (read-child-nodes node nil stream)
    (<span style="color: #a020f0;">when</span> children 
      (<span style="color: #a020f0;">unless</span> (eql (car children) (node.next-node node))
        <span style="color: #b22222;">;;; </span><span style="color: #b22222;">Somebody short-circuited the process, namely property-node. why?
</span>        (setf children (cons (node.next-node node) children))
        ))

    (setf (node.children node) children)
    new-node))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">read-node</span> <span style="color: #da70d6;">:around</span> ((node org-parent-node) stream)
 (<span style="color: #a020f0;">let</span> ((new-node (call-next-method)))
   (<span style="color: #a020f0;">if</span> (include-end-node-p node)
       (read-node new-node stream)
     new-node)))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">read-parent-node</span> (parent-node stream)
  (read-node parent-node stream) parent-node) 
    
(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">org-file</span> (org-parent-node) 
  ((pathname <span style="color: #da70d6;">:accessor</span> node.pathname <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:pathname</span>)))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">read-org-file</span> (pathname)
  (<span style="color: #a020f0;">let</span> ((node (make-instance 'org-file <span style="color: #da70d6;">:pathname</span> pathname)))
    (<span style="color: #a020f0;">alexandria:with-input-from-file</span> (stream pathname) 
      (read-parent-node node stream))))
</pre>



</div>

</div>

<div id="outline-container-4.5.3" class="outline-4">
<h4 id="sec-4.5.3">4.5.3 DELIMITED-NODE </h4>
<div id="text-4.5.3">





<pre class="src src-lisp">
(<span style="color: #a020f0;">in-package</span> <span style="color: #da70d6;">:cl-org-mode</span>)

(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">delimited-node</span> (org-parent-node)
  ((opening-delimiter <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:opening-delimiter</span> <span style="color: #da70d6;">:accessor</span> node.opening-delimiter <span style="color: #da70d6;">:initform</span> nil)
   (closing-delimiter <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:closing-delimiter</span> <span style="color: #da70d6;">:accessor</span> node.closing-delimiter <span style="color: #da70d6;">:initform</span> nil)
   (closing-delimiter-node <span style="color: #da70d6;">:accessor</span> node.closing-delimiter-node)
   (node-closed <span style="color: #da70d6;">:initform</span> nil <span style="color: #da70d6;">:accessor</span> node.closed-p))

  (<span style="color: #da70d6;">:default-initargs</span> <span style="color: #da70d6;">:include-end-node</span> t))

(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">closing-delimiter-node</span> (org-node)
 ((opening-delimiter-node <span style="color: #da70d6;">:accessor</span> node.opening-delimiter-node <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:opening-delimiter-node</span>)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">shared-initialize</span> <span style="color: #da70d6;">:after</span> ((node delimited-node) slots <span style="color: #228b22;">&amp;rest</span> args)
  (<span style="color: #a020f0;">declare</span> (ignore args))
  (setf (node.closing-delimiter-node node)
        (make-instance 'closing-delimiter-node <span style="color: #da70d6;">:opening-delimiter-node</span> node)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-dispatchers</span> ((node delimited-node))
  (<span style="color: #a020f0;">if</span> (node.closed-p node)
      (call-next-method)
      (cons (node.closing-delimiter-node node) (call-next-method))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-start</span> ((node delimited-node) stack)
  (<span style="color: #a020f0;">with-slots</span> (opening-delimiter) node
    (<span style="color: #a020f0;">when</span> opening-delimiter 
      (<span style="color: #a020f0;">multiple-value-bind</span> (delimiter old-stack)
          (stack-starts-with stack opening-delimiter)
        
        (<span style="color: #a020f0;">when</span> delimiter
          (values (make-instance (class-of node) 
                                 <span style="color: #da70d6;">:opening-delimiter</span> (stack-&gt;string delimiter)) 
                   old-stack))))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-start</span> ((node closing-delimiter-node) stack)

  (<span style="color: #a020f0;">with-slots</span> (closing-delimiter) (node.opening-delimiter-node node)
    (<span style="color: #a020f0;">multiple-value-bind</span> (indicator old-stack)
        (stack-starts-with stack closing-delimiter)
      (<span style="color: #a020f0;">when</span> indicator 
        (values node 
                old-stack)))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-end</span> ((node delimited-node) (next-node closing-delimiter-node) stack)
  (<span style="color: #a020f0;">when</span> (eq next-node (node.closing-delimiter-node node))
    (setf (node.closed-p node) t)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">read-next-node</span> <span style="color: #da70d6;">:around</span> ((node delimited-node) next-node stream)
  (call-next-method)
)
</pre>




</div>

</div>

<div id="outline-container-4.5.4" class="outline-4">
<h4 id="sec-4.5.4">4.5.4 OUTLINE-NODE : Used for org-mode outlines </h4>
<div id="text-4.5.4">






<pre class="src src-lisp">
(<span style="color: #a020f0;">in-package</span> <span style="color: #da70d6;">:cl-org-mode</span>)

(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">outline-node</span> (org-parent-node) 
  ((heading <span style="color: #da70d6;">:accessor</span> node.heading <span style="color: #da70d6;">:initform</span> nil <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:heading</span>)
   (heading-level-indicator <span style="color: #da70d6;">:accessor</span> node.heading-level-indicator
                            <span style="color: #da70d6;">:initform</span> nil
                            <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:indicator</span>)))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">at-outline-node-p</span> (stack)
  (<span style="color: #a020f0;">let</span> ((char (first stack))
        (stack (rest stack)))
    (and (eql char #\space)
         (eql (first stack) #\*)
         (<span style="color: #a020f0;">if</span> (or (null (rest stack))
                 (eql #\Newline (second stack)))
             (values t  (rest stack))
             (at-outline-node-p (cons char (rest stack)))))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-start</span> ((node outline-node) stack)
  (<span style="color: #a020f0;">multiple-value-bind</span> (pred old-stack) 
      (at-outline-node-p stack)
    (<span style="color: #a020f0;">if</span> pred 
        (values  
           (make-instance (class-of node) 
                          <span style="color: #da70d6;">:indicator</span>
                          (<span style="color: #a020f0;">loop</span> 
                             for cons on stack 
                             until (eq cons old-stack) 
                             collect (car cons))) 
           old-stack))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-end</span> ((node outline-node) (next-node outline-node) stack)   
  (&lt;= (length (node.heading-level-indicator next-node))
      (length (node.heading-level-indicator node))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-end</span> ((node outline-node) (next-node null) stack)   
  t)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">read-next-node</span> ((node outline-node) (next-node null) stream)
  (setf (node.heading node) (read-line stream nil))
  (call-next-method))
</pre>




</div>

</div>
