cl-org-mode.org
*** SRC-NODE : Make blocks out of BEGIN_SRC nodes.
#+BEGIN_SRC lisp
(in-package :cl-org-mode)

(defclass src-node (delimited-node text-node)
  ((emacs-mode :initarg :emacs-mode :accessor node.emacs-mode :initform nil))
  (:default-initargs 
    :opening-delimiter "#+BEGIN_SRC"
    :closing-delimiter (format nil "~%#+END_SRC")
    :text nil
    :include-end-node nil))


(defmethod node-dispatchers ((node src-node))
  (if (node.text node)
      (call-next-method)
      (list (node.closing-delimiter-node node))))

(defmethod read-next-node ((node src-node) (next-node null) stream)
  (setf (node.emacs-mode node) (read-line stream nil))
  (call-next-method))

(defmethod finalize-node ((node src-node) next-node stack)
  (setf (node.next-node node) next-node)
   (setf (node.text node) (stack->string stack))
  next-node)
#+END_SRC
*** PROPERTIES-NODE: Capture the :PROPERTIES drawer 
#+BEGIN_SRC lisp
(in-package :cl-org-mode)

(defclass properties-node (delimited-node)
  ()

  (:default-initargs 
    :opening-delimiter ":PROPERTIES:
"
    :closing-delimiter ":END:"))

(defmethod finalize-node ((node properties-node) next-node stack)
  (call-next-method))

(defclass property-node (delimited-node)
  ((property :initarg :property :accessor property-node.property)
   (value :initarg :value :accessor property-node.value))  
  (:default-initargs 
    :closing-delimiter (format nil "~%")))

(defmethod node-start ((node property-node) stack)
  (let ((pos (position #\: (cdr stack))))
    (when (and pos (eql #\: (car stack)))

      (let ((property (nreverse (coerce (subseq (cdr stack) 0 pos) 'string ))))
	(when property
	  (values (make-instance (class-of node)
				 :property property)
		  (subseq (cddr stack) pos)))))))


(defmethod finalize-node ((node property-node) next-node stack)
  (setf (property-node.value node) (nreverse (coerce (butlast stack) 'string)))
  (call-next-method node next-node (cons (first stack ) (last stack))))

(defmethod node-dispatchers ((node properties-node))
  (let ((dispatchers (call-next-method)))
    (list (node.closing-delimiter-node node)
	   (make-instance 'property-node)
	   )))

(defun get-property-value (node key)
  (let ((node (find-if 
	       (lambda (n)
		 (and (typep n 'property-node)
		      (equal (property-node.property n) key)))
	       (node.children node))))
    (when node (property-node.value node))))
#+END_SRC
**
** A printer for org-nodes
   :PROPERTIES:
   :source-file: printer.lisp
   :END:
#+BEGIN_SRC lisp
(in-package :cl-org-mode)

(defgeneric print-node (node &optional stream)
  (:documentation "Print text serialization of node.")
  (:method :around (node &optional (stream *standard-output*))
	   (call-next-method node stream)))

(defmethod print-node :around ((node delimited-node) &optional stream)
  (write-sequence (node.opening-delimiter node) stream)
  (call-next-method))

(defmethod print-node ((node closing-delimiter-node) &optional stream)
  (princ (node.closing-delimiter (node.opening-delimiter-node node)) stream))

(defmethod print-node :around ((node outline-node) &optional stream)
  (format stream "~A~A~%" 
	  (stack->string  (node.heading-level-indicator node))
	  (node.heading node)) 
  (call-next-method))

(defmethod print-node ((node property-node) &optional stream)
  (with-slots (property value) node
    (format stream ":~A: ~A~%" property value)))

(defmethod print-node  ((node src-node) &optional stream)
  (format stream "~A~%"(node.emacs-mode node))
  (write-sequence (node.text node) stream))
#+END_SRC

** Utilities
   - Note taken on [2009-11-28 Sat 15:24]
   :PROPERTIES:
   :source-file: utils.lisp
   :END:
#+BEGIN_SRC lisp
(in-package :cl-org-mode)

(defun stack->string (stack)
  (nreverse (coerce stack 'string)))

(defgeneric stack-starts-with (stack maybe-starts-with)
  (:documentation 
   "return (values start-of-stack rest-of-stack) if stack starts with maybe-starts-with.
If maybe-starts-with is a string. reverse it before testing against stack")
  (:method (stack list)
    ;; there are better ways to do this i'm sure.
    (let ((does-it? (when (>= (length stack)(length list))
		      (loop :for cons on stack 
			 :for pair on list
			 :always (eql (car cons) (first pair))))))
		      
      (when does-it? 
	(values list (nthcdr (length list) stack)))))
  
  (:method (stack (string string))
    (stack-starts-with stack (coerce (reverse string) 'list))))
#+END_SRC
    
