cl-org-mode.html

<div id="outline-container-4.5.5" class="outline-4">
<h4 id="sec-4.5.5">4.5.5 SRC-NODE : Make blocks out of BEGIN<sub>SRC</sub> nodes. </h4>
<div id="text-4.5.5">




<pre class="src src-lisp">
(<span style="color: #a020f0;">in-package</span> <span style="color: #da70d6;">:cl-org-mode</span>)

(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">src-node</span> (delimited-node text-node)
  ((emacs-mode <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:emacs-mode</span> <span style="color: #da70d6;">:accessor</span> node.emacs-mode <span style="color: #da70d6;">:initform</span> nil))
  (<span style="color: #da70d6;">:default-initargs</span> 
    <span style="color: #da70d6;">:opening-delimiter</span> <span style="color: #bc8f8f;">"#+BEGIN_SRC"</span>
    <span style="color: #da70d6;">:closing-delimiter</span> (format nil <span style="color: #bc8f8f;">"~%#+END_SRC"</span>)
    <span style="color: #da70d6;">:text</span> nil
    <span style="color: #da70d6;">:include-end-node</span> nil))


(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-dispatchers</span> ((node src-node))
  (<span style="color: #a020f0;">if</span> (node.text node)
      (call-next-method)
      (list (node.closing-delimiter-node node))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">read-next-node</span> ((node src-node) (next-node null) stream)
  (setf (node.emacs-mode node) (read-line stream nil))
  (call-next-method))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">finalize-node</span> ((node src-node) next-node stack)
  (setf (node.next-node node) next-node)
   (setf (node.text node) (stack-&gt;string stack))
  next-node)
</pre>



</div>

</div>

<div id="outline-container-4.5.6" class="outline-4">
<h4 id="sec-4.5.6">4.5.6 PROPERTIES-NODE: Capture the :PROPERTIES drawer </h4>
<div id="text-4.5.6">




<pre class="src src-lisp">
(<span style="color: #a020f0;">in-package</span> <span style="color: #da70d6;">:cl-org-mode</span>)

(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">properties-node</span> (delimited-node)
  ()

  (<span style="color: #da70d6;">:default-initargs</span> 
    <span style="color: #da70d6;">:opening-delimiter</span> <span style="color: #bc8f8f;">":PROPERTIES:
"</span>
    <span style="color: #da70d6;">:closing-delimiter</span> <span style="color: #bc8f8f;">":END:"</span>))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">finalize-node</span> ((node properties-node) next-node stack)
  (call-next-method))

(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">property-node</span> (delimited-node)
  ((property <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:property</span> <span style="color: #da70d6;">:accessor</span> property-node.property)
   (value <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:value</span> <span style="color: #da70d6;">:accessor</span> property-node.value))  
  (<span style="color: #da70d6;">:default-initargs</span> 
    <span style="color: #da70d6;">:closing-delimiter</span> (format nil <span style="color: #bc8f8f;">"~%"</span>)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-start</span> ((node property-node) stack)
  (<span style="color: #a020f0;">let</span> ((pos (position #\: (cdr stack))))
    (<span style="color: #a020f0;">when</span> (and pos (eql #\: (car stack)))

      (<span style="color: #a020f0;">let</span> ((property (nreverse (coerce (subseq (cdr stack) 0 pos) 'string ))))
        (<span style="color: #a020f0;">when</span> property
          (values (make-instance (class-of node)
                                 <span style="color: #da70d6;">:property</span> property)
                  (subseq (cddr stack) pos)))))))


(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">finalize-node</span> ((node property-node) next-node stack)
  (setf (property-node.value node) (nreverse (coerce (butlast stack) 'string)))
  (call-next-method node next-node (cons (first stack ) (last stack))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-dispatchers</span> ((node properties-node))
  (<span style="color: #a020f0;">let</span> ((dispatchers (call-next-method)))
    (list (node.closing-delimiter-node node)
           (make-instance 'property-node)
           )))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">get-property-value</span> (node key)
  (<span style="color: #a020f0;">let</span> ((node (find-if 
               (<span style="color: #a020f0;">lambda</span> (n)
                 (and (typep n 'property-node)
                      (equal (property-node.property n) key)))
               (node.children node))))
    (<span style="color: #a020f0;">when</span> node (property-node.value node))))
</pre>



<p>
**
</p></div>
</div>

</div>

<div id="outline-container-4.6" class="outline-3">
<h3 id="sec-4.6">4.6 A printer for org-nodes </h3>
<div id="text-4.6">




<pre class="src src-lisp">
(<span style="color: #a020f0;">in-package</span> <span style="color: #da70d6;">:cl-org-mode</span>)

(<span style="color: #a020f0;">defgeneric</span> <span style="color: #0000ff;">print-node</span> (node <span style="color: #228b22;">&amp;optional</span> stream)
  (<span style="color: #da70d6;">:documentation</span> <span style="color: #bc8f8f;">"Print text serialization of node."</span>)
  (<span style="color: #da70d6;">:method</span> <span style="color: #da70d6;">:around</span> (node <span style="color: #228b22;">&amp;optional</span> (stream *standard-output*))
           (call-next-method node stream)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">print-node</span> <span style="color: #da70d6;">:around</span> ((node delimited-node) <span style="color: #228b22;">&amp;optional</span> stream)
  (write-sequence (node.opening-delimiter node) stream)
  (call-next-method))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">print-node</span> ((node closing-delimiter-node) <span style="color: #228b22;">&amp;optional</span> stream)
  (princ (node.closing-delimiter (node.opening-delimiter-node node)) stream))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">print-node</span> <span style="color: #da70d6;">:around</span> ((node outline-node) <span style="color: #228b22;">&amp;optional</span> stream)
  (format stream <span style="color: #bc8f8f;">"~A~A~%"</span> 
          (stack-&gt;string  (node.heading-level-indicator node))
          (node.heading node)) 
  (call-next-method))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">print-node</span> ((node property-node) <span style="color: #228b22;">&amp;optional</span> stream)
  (<span style="color: #a020f0;">with-slots</span> (property value) node
    (format stream <span style="color: #bc8f8f;">":~A: ~A~%"</span> property value)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">print-node</span>  ((node src-node) <span style="color: #228b22;">&amp;optional</span> stream)
  (format stream <span style="color: #bc8f8f;">"~A~%"</span>(node.emacs-mode node))
  (write-sequence (node.text node) stream))
</pre>




</div>

</div>

<div id="outline-container-4.7" class="outline-3">
<h3 id="sec-4.7">4.7 Utilities </h3>
<div id="text-4.7">

<ul>
<li>
Note taken on <span class="timestamp">2009-11-28 Sat 15:24</span>



<pre class="src src-lisp">
(<span style="color: #a020f0;">in-package</span> <span style="color: #da70d6;">:cl-org-mode</span>)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">stack-&gt;string</span> (stack)
  (nreverse (coerce stack 'string)))

(<span style="color: #a020f0;">defgeneric</span> <span style="color: #0000ff;">stack-starts-with</span> (stack maybe-starts-with)
  (<span style="color: #da70d6;">:documentation</span> 
   <span style="color: #bc8f8f;">"return (values start-of-stack rest-of-stack) if stack starts with maybe-starts-with.
If maybe-starts-with is a string. reverse it before testing against stack"</span>)
  (<span style="color: #da70d6;">:method</span> (stack list)
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">there are better ways to do this i'm sure.
</span>    (<span style="color: #a020f0;">let</span> ((does-it? (<span style="color: #a020f0;">when</span> (&gt;= (length stack)(length list))
                      (<span style="color: #a020f0;">loop</span> <span style="color: #da70d6;">:for</span> cons on stack 
                         <span style="color: #da70d6;">:for</span> pair on list
                         <span style="color: #da70d6;">:always</span> (eql (car cons) (first pair))))))
                      
      (<span style="color: #a020f0;">when</span> does-it? 
        (values list (nthcdr (length list) stack)))))
  
  (<span style="color: #da70d6;">:method</span> (stack (string string))
    (stack-starts-with stack (coerce (reverse string) 'list))))
</pre>




</li>
</ul>
</div>
</div>

</div>
