cl-org-mode.org
* ORG-LITERATE-PROGRAMMING Source Code
  :PROPERTIES:
  :source-file: tangle.lisp
  :END: 
#+BEGIN_SRC lisp
(in-package :cl-org-mode)

(defun tangle-org-node (node &key (source-directory (node.pathname node)) source-file)
  "Arguments and Values:

node---an ORG-NODE
source-directory---a pathname,
source-file---a pathname.
result---returns NIL. 

Description:

Walk node and all its children, and print the contents of
any SRC-NODE to source-file. If source-file is a relative pathname, it
will be merged with source-directory.

If node or any of its children contain :source-file:
or :source-directory: properties, they will replace the value of
source-file or source-directory for that node and its children."

  (flet ((tangle () (loop for child in (node.children node)
	      :do  
	      (typecase child 
				(outline-node 
		 (let ((properties (find-if (lambda (x) (typep x 'properties-node))
					    (node.children child))))

		   (when properties 
		     (setf source-directory 
			   (let ((path (get-property-value properties "source-directory")))
			     (if path
				 (if (eq :RELATIVE (first (pathname-directory path)))
				     (merge-pathnames path source-directory)
				     path)
				 source-directory)))
		     (setf source-file (or (get-property-value properties "source-file") source-file)))
		   (tangle-org-node child 
				    :source-directory source-directory
				    :source-file source-file
				    )))
		(src-node
		 (if (streamp source-file)
		     (write-sequence (node.text child) source-file)
		     (warn "Source node has no stream")))))))
	 (if (and source-file
		  (not (streamp source-file)))
	     (alexandria:with-output-to-file (stream (merge-pathnames source-file source-directory) 
						     :if-exists :supersede 
						     :if-does-not-exist :create)
	       (setf source-file stream)
	       (tangle))
	     (tangle))))
#+END_SRC

* ORG-LISP-DOCUMENTATION
  :PROPERTIES:
  :source-file: org-lisp-documentation.lisp
  :END:
** Doctstring parsing
#+BEGIN_SRC lisp
(in-package :cl-org-mode)

(defclass lisp-docstring (org-parent-node) ())

(defmethod node-dispatchers :around ((node lisp-docstring))
  (mapcar #'make-instance '(lisp-docstring-section-node)))

(defclass lisp-docstring-section-node (lisp-docstring) 
  ((heading :accessor node.heading :initform nil :initarg :heading)))

(defun section-node-start-p (stack)
  (when (and (eql #\Newline (first stack))
	     (eql #\Newline (second stack))
	     (eql (third stack) #\:))
    (break "~A second stack" (char-name  (Second stack)))
    
    (let ((stack (cddr stack))) 
      (and (eql (first stack) #\:)
	   (loop 
	      :for (char . chars) on stack
	      :collect char into heading
	      :if (and (or (null chars)
			   (and (eql (first chars) #\Newline)
				(eql (second chars) #\Newline)))
		       (alpha-char-p char))
	      :do (return (values heading chars)))))))

(defmethod node-start ((node lisp-docstring-section-node) stack)
  (multiple-value-bind (heading old-stack) 
      (section-node-start-p stack)
    (if heading 
	(values  
	 (make-instance (class-of node) :heading (stack->string heading)) 
	   old-stack))))

(defmethod node-end ((node lisp-docstring-section-node) (next-node lisp-docstring-section-node) stack)   
  t)

(defmethod node-end ((node lisp-docstring-section-node) (next-node null) stack)   
  t)

(defmethod print-node ((node lisp-docstring-section-node) &optional stream)
  (format stream "*~A*~%~%"(node.heading node))
  (call-next-method))

(defun parse-docstring (string)
  (with-input-from-string (stream string) 
    (read-parent-node (make-instance 'lisp-docstring) stream)))
#+END_SRC

