cl-org-mode.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">5 ORG-LITERATE-PROGRAMMING Source Code </h2>
<div id="text-5">




<pre class="src src-lisp">
(<span style="color: #a020f0;">in-package</span> <span style="color: #da70d6;">:cl-org-mode</span>)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">tangle-org-node</span> (node <span style="color: #228b22;">&amp;key</span> (source-directory (node.pathname node)) source-file)
  <span style="color: #bc8f8f;">"Arguments and Values:

node---an ORG-NODE
source-directory---a pathname,
source-file---a pathname.
result---returns NIL. 

Description:

Walk node and all its children, and print the contents of
any SRC-NODE to source-file. If source-file is a relative pathname, it
will be merged with source-directory.

If node or any of its children contain :source-file:
or :source-directory: properties, they will replace the value of
source-file or source-directory for that node and its children."</span>

  (<span style="color: #a020f0;">flet</span> ((tangle () (<span style="color: #a020f0;">loop</span> for child in (node.children node)
              <span style="color: #da70d6;">:do</span>  
              (<span style="color: #a020f0;">typecase</span> child 
                                (outline-node 
                 (<span style="color: #a020f0;">let</span> ((properties (find-if (<span style="color: #a020f0;">lambda</span> (x) (typep x 'properties-node))
                                            (node.children child))))

                   (<span style="color: #a020f0;">when</span> properties 
                     (setf source-directory 
                           (<span style="color: #a020f0;">let</span> ((path (get-property-value properties <span style="color: #bc8f8f;">"source-directory"</span>)))
                             (<span style="color: #a020f0;">if</span> path
                                 (<span style="color: #a020f0;">if</span> (eq <span style="color: #da70d6;">:RELATIVE</span> (first (pathname-directory path)))
                                     (merge-pathnames path source-directory)
                                     path)
                                 source-directory)))
                     (setf source-file (or (get-property-value properties <span style="color: #bc8f8f;">"source-file"</span>) source-file)))
                   (tangle-org-node child 
                                    <span style="color: #da70d6;">:source-directory</span> source-directory
                                    <span style="color: #da70d6;">:source-file</span> source-file
                                    )))
                (src-node
                 (<span style="color: #a020f0;">if</span> (streamp source-file)
                     (write-sequence (node.text child) source-file)
                     (<span style="color: #ff0000; font-weight: bold;">warn</span> <span style="color: #bc8f8f;">"Source node has no stream"</span>)))))))
         (<span style="color: #a020f0;">if</span> (and source-file
                  (not (streamp source-file)))
             (<span style="color: #a020f0;">alexandria:with-output-to-file</span> (stream (merge-pathnames source-file source-directory) 
                                                     <span style="color: #da70d6;">:if-exists</span> <span style="color: #da70d6;">:supersede</span> 
                                                     <span style="color: #da70d6;">:if-does-not-exist</span> <span style="color: #da70d6;">:create</span>)
               (setf source-file stream)
               (tangle))
             (tangle))))
</pre>




</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">6 ORG-LISP-DOCUMENTATION </h2>
<div id="text-6">


</div>

<div id="outline-container-6.1" class="outline-3">
<h3 id="sec-6.1">6.1 Doctstring parsing </h3>
<div id="text-6.1">




<pre class="src src-lisp">
(<span style="color: #a020f0;">in-package</span> <span style="color: #da70d6;">:cl-org-mode</span>)

(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">lisp-docstring</span> (org-parent-node) ())

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-dispatchers</span> <span style="color: #da70d6;">:around</span> ((node lisp-docstring))
  (mapcar #'make-instance '(lisp-docstring-section-node)))

(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">lisp-docstring-section-node</span> (lisp-docstring) 
  ((heading <span style="color: #da70d6;">:accessor</span> node.heading <span style="color: #da70d6;">:initform</span> nil <span style="color: #da70d6;">:initarg</span> <span style="color: #da70d6;">:heading</span>)))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">section-node-start-p</span> (stack)
  (<span style="color: #a020f0;">when</span> (and (eql #\Newline (first stack))
             (eql #\Newline (second stack))
             (eql (third stack) #\:))
    (<span style="color: #a020f0;">break</span> <span style="color: #bc8f8f;">"~A second stack"</span> (char-name  (Second stack)))
    
    (<span style="color: #a020f0;">let</span> ((stack (cddr stack))) 
      (and (eql (first stack) #\:)
           (<span style="color: #a020f0;">loop</span> 
              <span style="color: #da70d6;">:for</span> (char . chars) on stack
              <span style="color: #da70d6;">:collect</span> char into heading
              <span style="color: #da70d6;">:if</span> (and (or (null chars)
                           (and (eql (first chars) #\Newline)
                                (eql (second chars) #\Newline)))
                       (alpha-char-p char))
              <span style="color: #da70d6;">:do</span> (<span style="color: #a020f0;">return</span> (values heading chars)))))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-start</span> ((node lisp-docstring-section-node) stack)
  (<span style="color: #a020f0;">multiple-value-bind</span> (heading old-stack) 
      (section-node-start-p stack)
    (<span style="color: #a020f0;">if</span> heading 
        (values  
         (make-instance (class-of node) <span style="color: #da70d6;">:heading</span> (stack-&gt;string heading)) 
           old-stack))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-end</span> ((node lisp-docstring-section-node) (next-node lisp-docstring-section-node) stack)   
  t)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">node-end</span> ((node lisp-docstring-section-node) (next-node null) stack)   
  t)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">print-node</span> ((node lisp-docstring-section-node) <span style="color: #228b22;">&amp;optional</span> stream)
  (format stream <span style="color: #bc8f8f;">"*~A*~%~%"</span>(node.heading node))
  (call-next-method))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">parse-docstring</span> (string)
  (<span style="color: #a020f0;">with-input-from-string</span> (stream string) 
    (read-parent-node (make-instance 'lisp-docstring) stream)))
</pre>




</div>

</div>
