cl-org-mode.org
** Print lisp documentation  
#+BEGIN_SRC lisp
(in-package :cl-org-mode)

(defun print-docstring (name type stream)
  (let ((docstring (parse-docstring (documentation name type))))
    (if (typep (first (node.children docstring)) 'lisp-docstring-section-node)
	(print-node docstring stream)
	(progn (format stream "*Description:*~%")
	       (print-node docstring stream)))))

(defun print-doc-title (object name stream)
  (format stream "/~A/ "   
	  (split-sequence:split-sequence #\- (princ-to-string (type-of object))))
  (format stream "=~a="   
	  name))

(defun newline-and-indent (stream depth &optional (num 1)  (char #\Space) (newline #'terpri))
  (dotimes (n num) (funcall newline stream)
	   (dotimes (n depth)
	     (princ char stream))
	   (princ #\Space stream)))

(defun cl-user::%t (stream arg colon at &rest parameters)
  (if (listp arg)
      (destructuring-bind (depth char) arg
	(newline-and-indent stream depth (or (first parameters) 1) char (if colon #'fresh-line #'terpri)))
      (newline-and-indent stream arg (or (first parameters) 1))))

(defun convert-newline-to-indent (string indent-level output-stream)
  (map nil (lambda (char) (if (eql char #\newline)
			      (format output-stream "~/%t/" indent-level)
			      (princ char output-stream)))
       string))
(defun print-lisp-documentation-to-org-node (spec stream &key (starting-depth 2))
  (flet ((p ()
	   (format stream "~2/%t/" starting-depth)) 
	 (print-doc-title (object name)
	   (format stream "~:/%t/~@?~2/%t/~4:*~@?" 		 
		   `(,starting-depth #\*)
		   "/~:(~{~A~^ ~}~)/ =~A="
		   (split-sequence:split-sequence  #\- (princ-to-string (type-of object)))
		   name
		   starting-depth))
	 (print-function-syntax (name)
	   (format stream "*Syntax:*~2/%t/=~(~A~)= " 
		   starting-depth 
		   name)
	   (dolist (arg (swank::arglist name))
	     (and (listp arg) (setf arg (car arg)))
	     (format stream
		     (if (and (symbolp arg) 
			      (eql (aref (symbol-name arg) 0)
				   #\&))
			 "/~(~A~)/ "
			 "~(~A~) ") 
		     arg) )
	   (format stream "=> /result/")))


    (if (listp spec)
	(destructuring-bind (type name) spec
	  (case type
	    (function 
	     (let ((function (eval `#',name)))
	       (print-doc-title function name)
	       (p)
	       (print-function-syntax name)
	       (p)
	       (convert-newline-to-indent 
		(with-output-to-string (s) (print-docstring name type s))
		starting-depth 
		stream))))
	  ))))
#+END_SRC
  

  
  
