cl-org-mode.html

<div id="outline-container-6.2" class="outline-3">
<h3 id="sec-6.2">6.2 Print lisp documentation </h3>
<div id="text-6.2">




<pre class="src src-lisp">
(<span style="color: #a020f0;">in-package</span> <span style="color: #da70d6;">:cl-org-mode</span>)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">print-docstring</span> (name type stream)
  (<span style="color: #a020f0;">let</span> ((docstring (parse-docstring (documentation name type))))
    (<span style="color: #a020f0;">if</span> (typep (first (node.children docstring)) 'lisp-docstring-section-node)
        (print-node docstring stream)
        (<span style="color: #a020f0;">progn</span> (format stream <span style="color: #bc8f8f;">"*Description:*~%"</span>)
               (print-node docstring stream)))))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">print-doc-title</span> (object name stream)
  (format stream <span style="color: #bc8f8f;">"/~A/ "</span>   
          (split-sequence:split-sequence #\- (princ-to-string (type-of object))))
  (format stream <span style="color: #bc8f8f;">"=~a="</span>   
          name))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">newline-and-indent</span> (stream depth <span style="color: #228b22;">&amp;optional</span> (num 1)  (char #\Space) (newline #'terpri))
  (<span style="color: #a020f0;">dotimes</span> (n num) (funcall newline stream)
           (<span style="color: #a020f0;">dotimes</span> (n depth)
             (princ char stream))
           (princ #\Space stream)))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">cl-user::%t</span> (stream arg colon at <span style="color: #228b22;">&amp;rest</span> parameters)
  (<span style="color: #a020f0;">if</span> (listp arg)
      (<span style="color: #a020f0;">destructuring-bind</span> (depth char) arg
        (newline-and-indent stream depth (or (first parameters) 1) char (<span style="color: #a020f0;">if</span> colon #'fresh-line #'terpri)))
      (newline-and-indent stream arg (or (first parameters) 1))))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">convert-newline-to-indent</span> (string indent-level output-stream)
  (map nil (<span style="color: #a020f0;">lambda</span> (char) (<span style="color: #a020f0;">if</span> (eql char #\newline)
                              (format output-stream <span style="color: #bc8f8f;">"~/%t/"</span> indent-level)
                              (princ char output-stream)))
       string))
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">print-lisp-documentation-to-org-node</span> (spec stream <span style="color: #228b22;">&amp;key</span> (starting-depth 2))
  (<span style="color: #a020f0;">flet</span> ((p ()
           (format stream <span style="color: #bc8f8f;">"~2/%t/"</span> starting-depth)) 
         (print-doc-title (object name)
           (format stream <span style="color: #bc8f8f;">"~:/%t/~@?~2/%t/~4:*~@?"</span>               
                   `(,starting-depth #\*)
                   <span style="color: #bc8f8f;">"/~:(~{~A~^ ~}~)/ =~A="</span>
                   (split-sequence:split-sequence  #\- (princ-to-string (type-of object)))
                   name
                   starting-depth))
         (print-function-syntax (name)
           (format stream <span style="color: #bc8f8f;">"*Syntax:*~2/%t/=~(~A~)= "</span> 
                   starting-depth 
                   name)
           (<span style="color: #a020f0;">dolist</span> (arg (swank::arglist name))
             (and (listp arg) (setf arg (car arg)))
             (format stream
                     (<span style="color: #a020f0;">if</span> (and (symbolp arg) 
                              (eql (aref (symbol-name arg) 0)
                                   #\&amp;))
                         <span style="color: #bc8f8f;">"/~(~A~)/ "</span>
                         <span style="color: #bc8f8f;">"~(~A~) "</span>) 
                     arg) )
           (format stream <span style="color: #bc8f8f;">"=&gt; /result/"</span>)))


    (<span style="color: #a020f0;">if</span> (listp spec)
        (<span style="color: #a020f0;">destructuring-bind</span> (type name) spec
          (<span style="color: #a020f0;">case</span> type
            (function 
             (<span style="color: #a020f0;">let</span> ((function (eval `#',name)))
               (print-doc-title function name)
               (p)
               (print-function-syntax name)
               (p)
               (convert-newline-to-indent 
                (<span style="color: #a020f0;">with-output-to-string</span> (s) (print-docstring name type s))
                starting-depth 
                stream))))
          ))))
</pre>







</div>
</div>
</div>
<div id="postamble"><p class="author"> Author: Drew Crampsie
<a href="mailto:Drew Crampsie <drewc@tech.coop>">&lt;Drew Crampsie <drewc@tech.coop>&gt;</a>
</p>
<p class="date"> Date: 2009-12-01 12:10:19 PST</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
